nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core1.xml
        <register>
          <name>AGC_CTRL_STAT</name>
          <description>AGC Control Status</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x17E802C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_MAX_IDX</name>
              <description>AGC Max Gain Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_INIT_IDX</name>
              <description>AGC Initial Gain Index</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_PHY_HOLD_TRIG_SEL</name>
              <description>AGC PHY Hold Trigger Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_PHY_HOLD_TRIG_SEL_0</name>
                  <description>PHY_AGC_HOLD_TRIG is select as AGC hold trig.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_PHY_HOLD_TRIG_SEL_1</name>
                  <description>PHY_AGC_FREEZE_TRIG is select as AGC hold trig.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_PHY_FREEZE_TRIG_SEL</name>
              <description>AGC PHY Freeze Trigger Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_PHY_FREEZE_TRIG_SEL_0</name>
                  <description>PHY_AGC_FREEZE_TRIG is select as AGC freeze trig.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_PHY_FREEZE_TRIG_SEL_1</name>
                  <description>PHY_AGC_HOLD_TRIG is select as AGC freeze trig.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_CALC_MAG_IN_FRZ</name>
              <description>AGC Calculate Magnitude In Freeze Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNFREEZE_FEAT_EN</name>
              <description>AGC Unfreeze Feature Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_UNFREEZE_FEAT_EN_0</name>
                  <description>AGC unfreeze function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_UNFREEZE_FEAT_EN_1</name>
                  <description>AGC will exit FREEZE mode when AGC_UNFREEZE_TMEOUT matched and aa_found not be asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_FREEZE_EN</name>
              <description>AGC Freeze Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_FREEZE_EN_0</name>
                  <description>Disable AGC freeze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_FREEZE_EN_1</name>
                  <description>AGC freeze when AA/SFD matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_FREEZE_EN_2</name>
                  <description>AGC freeze when AGC freeze timeout matched</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_FREEZE_EN_3</name>
                  <description>AGC freeze when AA/SFD matched or freeze timeout matched</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_GAIN_IDX_STORE</name>
              <description>Enable and config AGC gain index store function</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_GAIN_IDX_STORE_0</name>
                  <description>AGC gain index store function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_IDX_STORE_1</name>
                  <description>Store AGC gain index when AGC enter into HOLD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_IDX_STORE_2</name>
                  <description>Store AGC gain index when AGC enter into FREEZE mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_IDX_STORE_3</name>
                  <description>Store AGC gain index when AA matched</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_SOFT_RST_GAIN_SEL</name>
              <description>PHY AGC Soft Reset Gain Sel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_GAIN_SEL_0</name>
                  <description>AGC keep current gain index when PHY AGC soft reset trigged,</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_GAIN_SEL_1</name>
                  <description>AGC return to AGC_INIT_IDX when PHY AGC soft reset trigged,</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_SOFT_RST_SRC_SEL</name>
              <description>PHY AGC Soft Reset Sel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_SRC_SEL_0</name>
                  <description>Disable PHY AGC soft reset function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_SRC_SEL_1</name>
                  <description>Use posedge phy_soft_rst to reset AGC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_SRC_SEL_2</name>
                  <description>Use negedge phy_soft_rst to reset AGC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_SOFT_RST_SRC_SEL_3</name>
                  <description>Use negedge phy_agc_freeze_trig to reset AGC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_PREV_GAIN_IDX</name>
              <description>AGC Previous Gain Index</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AGC_GAIN_IDX</name>
              <description>AGC Gain Index</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AGC_GAIN_CHANGE</name>
              <description>AGC Gain Change</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AGC_GAIN_CHANGE_STATUS</name>
              <description>AGC Gain Change Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_0</name>
                  <description>No gain change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_1</name>
                  <description>Gain decreased by WBD step1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_2</name>
                  <description>Gain decreased by WBD step2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_3</name>
                  <description>Gain decreased by fast mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_4</name>
                  <description>Gain increased by fast mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_5</name>
                  <description>Gain decreased by slow mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_6</name>
                  <description>Gain increased by slow mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_GAIN_CHANGE_STATUS_7</name>
                  <description>Gain increased by delta slow mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_STATUS</name>
              <description>AGC FSM Status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_STATUS_0</name>
                  <description>AGC_IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_1</name>
                  <description>AGC_WB_ONLY</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_2</name>
                  <description>AGC_WB_MAG</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_3</name>
                  <description>AGC_WB_DEBOUNCE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_4</name>
                  <description>AGC_MAG_ONLY</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_5</name>
                  <description>AGC_HOLD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_6</name>
                  <description>AGC_FREEZE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_STATUS_7</name>
                  <description>AGC_WAIT_GAIN_SETTLE</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING0</name>
          <description>AGC Timing Control 0</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8104398</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_DELTA_SLOW_WAIT</name>
              <description>AGC Delta Slow Mode Timing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP2_TIMEOUT</name>
              <description>AGC WBD Step2 Timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP1_TIMEOUT</name>
              <description>AGC WBD Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_GAIN_STEP_WAIT</name>
              <description>AGC Gain Change Wait Time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_MAG_INIT_WAIT</name>
              <description>AGC Magnitude Mode Initial Wait Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_INIT_WAIT</name>
              <description>AGC WBD Mode Initial Wait Time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING1</name>
          <description>AGC Timing Control 1</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1902440A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_FREEZE_TIMEOUT</name>
              <description>AGC FREEZE Mode Wait Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HOLD_TIMEOUT</name>
              <description>AGC HOLD Mode Wait Time</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP2_DUAL_CLIP_WAIT</name>
              <description>AGC WBD step2 Debounce Wait Time</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP1_DUAL_CLIP_WAIT</name>
              <description>AGC WBD step1 Debounce Wait Time</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP2_WAIT</name>
              <description>AGC Gain Change Wait For WBD step2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_DUAL_CLIP_TIMEOUT</name>
              <description>Indicate the max duration, count by reference clk, for WBD debounce</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING2</name>
          <description>AGC Timing Control 2</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_UNFREEZE_FEAT_TIMEOUT</name>
              <description>AGC Unfreeze Feature Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNHOLD_FEAT_TIMEOUT</name>
              <description>AGC Unhold Feature Timeout</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNHOLD_GAIN_CHG</name>
              <description>AGC Gain Index Change When UNHOLD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNHOLD_MAG_CNT</name>
              <description>AGC Unhold Magnitude Count Selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNHOLD_MAG_SRC</name>
              <description>AGC Magnitude Unhold Feature Source Selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_UNHOLD_MAG_SRC_0</name>
                  <description>fast_mag</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_UNHOLD_MAG_SRC_1</name>
                  <description>slow_mag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING0_DRS</name>
          <description>AGC Timing Control 0 DRS</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_GAIN_STEP_WAIT</name>
              <description>AGC Gain Change Wait Time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_EN_DRS</name>
              <description>DRS version of AGC_CTRL[AGC_WBD_EN]</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING1_DRS</name>
          <description>AGC Timing Control 1 DRS</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_FREEZE_TIMEOUT</name>
              <description>AGC FREEZE Mode Wait Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HOLD_TIMEOUT</name>
              <description>AGC HOLD Mode Wait Time</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TIMING2_DRS</name>
          <description>AGC Timing Control 2 DRS</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_UNFREEZE_FEAT_TIMEOUT</name>
              <description>AGC Unfreeze Feature Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_UNHOLD_FEAT_TIMEOUT</name>
              <description>AGC Unhold Feature Timeout</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
