nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core1.xml
        <register>
          <name>DMD_CTRL0</name>
          <description>PHY Demodulator Control 0</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TED_ACT_WIN</name>
              <description>Active window size for the time tracking mechanism, expressed in symbols.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FED_ACT_WIN</name>
              <description>Active window size for the frequency tracking mechanism, expressed in symbols.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREP_SCALE_FREQ</name>
              <description>Frequency domain signal scaling factor used by the de-repeater.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT_FACTOR</name>
              <description>Repetition factor used by the de-repeater.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FED_ERR_SCALE</name>
              <description>Scaling factor used by the frequency tracking loop.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TERR_TRK_EN</name>
              <description>Enables time tracking in the demodulator.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FERR_TRK_EN</name>
              <description>Enables frequency tracking in the demodulator.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREP_SINE_EN</name>
              <description>Flag used to enable the non-linear operation in the de-repeater.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOD_MOD</name>
              <description>Determines the number of taps used by the demodulator correlators;</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>use 12 taps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>use 4 taps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>use 7 taps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>use 13 taps</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_CTRL1</name>
          <description>PHY Demodulator Control 1</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FED_IDLE_WIN</name>
              <description>Idle window size for the frequency tracking mechanism, expressed in symbols.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TED_ERR_SCALE</name>
              <description>Scaling factor used by the time tracking loop.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FED_IMM_MEAS_EN</name>
              <description>Specifies whether the frequency tracking starts with an active window;</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>start with idle window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>start with active window</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TED_IDLE_WIN</name>
              <description>Idle window size for the time tracking mechanism, expressed in symbols.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTRK_INT_RANGE</name>
              <description>Timing error correction interpolation range, expressed in samples. The value must equal or bigger than 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TED_IMM_MEAS_EN</name>
              <description>Specifies whether the time tracking starts with an active window;</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>start with idle window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>start with active window</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_CTRL2</name>
          <description>PHY Demodulator Control 2</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAIT_DMD_LR_ADJ</name>
              <description>Reserved. Must be programed as reset value 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_VIA_AFTER_AA_ADJ</name>
              <description>Reserved. Must be programed as reset value 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_DMD_CLKEN_ADJ</name>
              <description>Reserved. Must be programed as reset value 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0xC</dimIncrement>
          <name>DEMOD_WAVE[%s]</name>
          <description>Array of registers: DMD_WAVE_REG0, DMD_WAVE_REG1, DMD_WAVE_REG2</description>
          <addressOffset>0xB8</addressOffset>
          <register>
            <name>DMD_WAVE_REG0</name>
            <description>PHY Demodulator Wavei Register 0</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SMPL0</name>
                <description>Demodulator waveform 0 sample 0 (sfix6en5)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL1</name>
                <description>Demodulator waveform 0 sample 1 (sfix6en5)</description>
                <bitOffset>6</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL2</name>
                <description>Demodulator waveform 0 sample 2 (sfix6en5)</description>
                <bitOffset>12</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL3</name>
                <description>Demodulator waveform 0 sample 3 (sfix6en5)</description>
                <bitOffset>18</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL4</name>
                <description>Demodulator waveform 0 sample 4 (sfix6en5)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DMD_WAVE_REG1</name>
            <description>PHY Demodulator Wavei Register 1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SMPL5</name>
                <description>Demodulator waveform 0 sample 5 (sfix6en5)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL6</name>
                <description>Demodulator waveform 0 sample 6 (sfix6en5)</description>
                <bitOffset>6</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL7</name>
                <description>Demodulator waveform 0 sample 7 (sfix6en5)</description>
                <bitOffset>12</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL8</name>
                <description>Demodulator waveform 0 sample 8 (sfix6en5)</description>
                <bitOffset>18</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL9</name>
                <description>Demodulator waveform 0 sample 9 (sfix6en5)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DMD_WAVE_REG2</name>
            <description>PHY Demodulator Wavei Register 2</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SMPL10</name>
                <description>Demodulator waveform 0 sample 10 (sfix6en5)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL11</name>
                <description>Demodulator waveform 0 sample 11 (sfix6en5)</description>
                <bitOffset>6</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SMPL12</name>
                <description>Demodulator waveform 0 sample 12 (sfix6en5)</description>
                <bitOffset>12</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DMDAA_CTRL</name>
          <description>PHY Demodulator Based SFD Confirmation control register.</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMDAA_HAMM_LP</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match in low power case; valid range [0,7].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMDAA_HAMM_HP</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match in high power case; valid range [0,7].</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPOW_DIS_OVRD</name>
              <description>Override the feature: disable DMDAA when power sensitivity is higher;</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable override, DMDAA disabled when power is high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable override, DMDAA enabled when power is high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMDAA_EN</name>
              <description>Enables Demodulator Based SFD Confirmation;</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_STAT</name>
          <description>High resolution Time-Of-Flight calculation Status.</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x54010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTT_CFO</name>
              <description>The high accuracy CFO computed by the HARTT block through the CORDIC algorithm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_P_DELTA</name>
              <description>Difference between the squared correlation magnitude values, pm-pp provided by the HARTT block, format is sfix10En9.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_DIST_SAT</name>
              <description>Computed Hamming distance saturated to 2 bits, format is ufix2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_INT_ADJ</name>
              <description>An integer adjustment of the timing which takes a value different of 0 when the early-late mechanism in the HARTT block chooses a peak different of the one chosen in the acquisition module (possible values are {-1,0,+1}).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_FOUND</name>
              <description>Flag that indicates that the HARTT operation is done and a valid PN pattern was detected.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_CTRL</name>
          <description>PHY RTT control register.</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HA_RTT_THRESHOLD</name>
              <description>threshold used to validate a HA RTT result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIRST_PDU_BIT</name>
              <description>is programmed by software - used for regular packets high accuracy RTT;</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTT_SEQ_LEN</name>
              <description>Allow PHY Demodulation during RTT computation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERRD_PROGR_AA</name>
              <description>Enables overriding the programmed AA bits with the PN sequence used by RTT;</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HIGH_ACC_RTT</name>
              <description>enables the use of the HA RTT block;</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_REF</name>
          <description>PHY RTT reference register.</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FM_REF_010</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FM_REF_110</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FM_REF_111</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
