nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NPX</name>
      <description>FMC</description>
      <groupName>NPX</groupName>
      <baseAddress>0xA91A5000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1E8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NPXCR</name>
          <description>NPX Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEE</name>
              <description>Global Encryption Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCRYPTION_ENABLED</name>
                  <description>Global encryption enabled. NPX on-the-fly encryption is enabled if the flash access hits in a valid memory region. Subsequent reads return 010b.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCRYPTION_DISABLED</name>
                  <description>Global encryption disabled. NPX on-the-fly encryption is disabled. Subsequent reads return 000b.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDE</name>
              <description>Global Decryption Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECRYPTION_ENABLED</name>
                  <description>Global decryption enabled. NPX on-the-fly decryption is globally enabled. Subsequent reads return 010b.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECRYPTION_DISABLED</name>
                  <description>Global decryption disabled. NPX on-the-fly decryption is globally disabled. Subsequent reads return 000b.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLK</name>
              <description>System Lock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_ENABLED</name>
                  <description>Lock enabled: cannot write (via IPS) to keys, masks, regions, NPXCR (NPX Control Register), NPXSR (NPX Status Register). Subsequent reads return 010b.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DISABLED</name>
                  <description>Lock disabled Subsequent reads return 000b.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLK</name>
              <description>Global Lock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_ENABLED</name>
                  <description>Lock enabled: cannot write to keys, masks, regions, NPXCR (NPX Control Register), NPXSR (NPX Status Register). Subsequent reads return 010b.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DISABLED</name>
                  <description>Lock disabled. Subsequent reads return 000b.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NPXSR</name>
          <description>NPX Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NRGD</name>
              <description>Number of implemented memory regions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREGIONSAREVALID</name>
                  <description>No (zero) implemented memory regions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEREGIONISVALID</name>
                  <description>1 implemented memory region</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOREGIONSAREVALID</name>
                  <description>2 implemented memory regions</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEREGIONSAREVALID</name>
                  <description>3 implemented memory regions</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURREGIONSAREVALID</name>
                  <description>4 implemented memory regions</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V0</name>
              <description>Key n Valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_NOTVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V1</name>
              <description>Key n Valid</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_NOTVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2</name>
              <description>Key n Valid</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_NOTVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V3</name>
              <description>Key n Valid</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_NOTVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>NPX_region[%s]</name>
          <description>Array of registers: MRENDADDR, MRMASKEDKEYWORD0, MRMASKEDKEYWORD1, MRMASKEDKEYWORD2, MRMASKEDKEYWORD3, MRMASKFORKEYWORD0, MRMASKFORKEYWORD1, MRMASKFORKEYWORD2, MRMASKFORKEYWORD3, MRSTARTADDR</description>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>MRMASKEDKEYWORD0</name>
            <description>Memory Region r, Masked Key Word 0</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASKEDKEY0WORD0</name>
                <description>Masked Key Word 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKEDKEYWORD1</name>
            <description>Memory Region r, Masked Key Word 1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASKEDKEY0WORD1</name>
                <description>Masked Key Word 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKEDKEYWORD2</name>
            <description>Memory Region r, Masked Key Word 2</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASKEDKEY0WORD2</name>
                <description>Masked Key Word 2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKEDKEYWORD3</name>
            <description>Memory Region r, Masked Key Word 3</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASKEDKEY0WORD3</name>
                <description>Masked Key Word 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKFORKEYWORD0</name>
            <description>Memory Region r, Mask for Key Word 0</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASK0WORD0</name>
                <description>Mask for Key Word 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKFORKEYWORD1</name>
            <description>Memory Region r, Mask for Key Word 1</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASK0WORD1</name>
                <description>Mask for Key Word 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKFORKEYWORD2</name>
            <description>Memory Region r, Mask for Key Word 2</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASK0WORD2</name>
                <description>Mask for Key Word 2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRMASKFORKEYWORD3</name>
            <description>Memory Region r, Mask for Key Word 3</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MASK0WORD3</name>
                <description>Mask for Key Word 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRSTARTADDR</name>
            <description>Memory Region r Start Address</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SRTADDR0</name>
                <description>Start Address for Memory Region 0</description>
                <bitOffset>9</bitOffset>
                <bitWidth>23</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MRENDADDR</name>
            <description>Memory Region r End Address</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x1FD</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>V</name>
                <description>Memory Region 0 is Valid</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VALID</name>
                    <description>Memory Region 0 is valid. Subsequent reads return 111b.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVALID</name>
                    <description>Memory Region 0 is not valid.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENDADDR0</name>
                <description>End Address for Memory Region 0</description>
                <bitOffset>9</bitOffset>
                <bitWidth>23</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
        </cluster>
