nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core1.xml
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHANNEL[%s]</name>
          <description>Array of registers: CVAL, TCTRL, TVAL</description>
          <addressOffset>0x20</addressOffset>
          <register>
            <name>TVAL</name>
            <description>Timer Value</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMR_VAL</name>
                <description>Timer Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INVALID_COMPARE_MODE_VALUE_0</name>
                    <description>Invalid load value in Compare mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVALID_COMPARE_MODE_VALUE_1</name>
                    <description>Invalid load value in Compare mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_2</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_3</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_5</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_6</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_7</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_8</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_9</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_10</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_11</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967290</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967291</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967292</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967293</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967294</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE_4294967295</name>
                    <description>In Compare mode: the value to be loaded; in Capture mode, the value of the timer</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CVAL</name>
            <description>Current Timer Value</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMR_CUR_VAL</name>
                <description>Current Timer Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCTRL</name>
            <description>Timer Control</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_EN</name>
                <description>Timer Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHAIN</name>
                <description>Chain Channel</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Timer Operation Mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CTR_32BIT</name>
                    <description>32-bit periodic counter</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTR_DUAL_16BIT</name>
                    <description>Dual 16-bit periodic counter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_ACCUM_32BIT</name>
                    <description>32-bit trigger accumulator</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_INPUT_32BIT</name>
                    <description>32-bit trigger input capture</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TSOT</name>
                <description>Timer Start on Trigger</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IMMEDIATELY</name>
                    <description>Immediately</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RISING_EDGE</name>
                    <description>When a rising edge is detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TSOI</name>
                <description>Timer Stop on Interrupt</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Does not stop</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Stops</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TROT</name>
                <description>Timer Reload on Trigger</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Does not reload</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Reloads</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRG_SRC</name>
                <description>Trigger Source</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EXT_TRIG</name>
                    <description>External</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INT_TRIG</name>
                    <description>Internal</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRG_SEL</name>
                <description>Trigger Select</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRIG_SOURCE_0</name>
                    <description>Timer channel 0-3 trigger source</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_SOURCE_1</name>
                    <description>Timer channel 0-3 trigger source</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_SOURCE_2</name>
                    <description>Timer channel 0-3 trigger source</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_SOURCE_3</name>
                    <description>Timer channel 0-3 trigger source</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
