nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MUA</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0xA91D3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VER</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x309000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Set Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAR</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3040404</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TR_NUM</name>
              <description>Transmit Register Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RR_NUM</name>
              <description>Receive Register Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIR_NUM</name>
              <description>General-Purpose Interrupt Request Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLAG_WIDTH</name>
              <description>Flag Width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUR</name>
              <description>MU Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF7E</resetMask>
          <fields>
            <field>
              <name>MURS</name>
              <description>MUA and MUB Reset State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Out of reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>In reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP</name>
              <description>MUA Side Event Pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUP</name>
              <description>MUA Flag Update Pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>No pending update flags (initiated by MUA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Pending update flags (initiated by MUA)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIRP</name>
              <description>MUA General-Purpose Interrupt Pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>No request sent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Request sent</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEP</name>
              <description>MUA Transmit Empty Pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>No MUA transmit empty event pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Pending; any TCR[TIEn] field is 1 and TSR[TEn] flag is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFP</name>
              <description>MUA Receive Full Pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Not pending; MUB is not writing to a Transmit register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Pending; MUB is writing to a Transmit register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEP</name>
              <description>Processor B Event Pending</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>No event pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Event pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR0</name>
          <description>Core Control 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NMI</name>
              <description>MUB Nonmaskable Interrupt Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Nonmaskable interrupt not issued</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Nonmaskable interrupt issued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT</name>
              <description>Target Processor B Boot Configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor Boot option 0 = 0x2002_0000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor Boot option 1 = 0x2002_8000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Processor Boot option 2 = 0x2003_0000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>three</name>
                  <description>Processor Boot option 3 = Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER0</name>
          <description>Core Interrupt Enable 0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RUNIE</name>
              <description>Processor B Run Mode Entry Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAIE</name>
              <description>Processor B Reset Assertion Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALTIE</name>
              <description>Processor B Halt Mode Entry Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITIE</name>
              <description>Processor B Wait Mode Entry Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPIE</name>
              <description>Processor B Stop Mode Entry Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDIE</name>
              <description>Processor B Power-Down Mode Entry Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSR0</name>
          <description>Core Sticky Status 0</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF02</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>NMIC</name>
              <description>Processor A Nonmaskable Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Default</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Clear MUB_CCR0[NMI]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>Processor B Run Mode Entry Interrupt Pending Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter Run mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered Run mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAIP</name>
              <description>Processor B Reset Asserted Interrupt Pending Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Processor B Halt Mode Entry Interrupt Pending Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter Halt Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered Halt Mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT</name>
              <description>Processor B Wait Mode Entry Interrupt Pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter Wait Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered Wait Mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Processor B Stop Mode Entry Interrupt Pending Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD</name>
              <description>Processor B Power-Down mode Entry Interrupt Pending Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Processor B did not enter Power-Down mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Processor B entered Power-Down mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
